# Bases de Datos I
## Laboratorio 11: Consolidaci√≥n SQL.

¬°¬°¬ø¬øEn este punto ya somos todos unos expertos en Bases de Datos verdad??!!

;)

¬°¬øQu√© tal si desarrollamos un par de ejercicios m√°s para fijar todo ese s√∫per conocimiento que hemos adquirido de MySQL!? Adelanteee...

### Configuraci√≥n ‚öôÔ∏è

In [ ]:
import sqlalchemy
sqlalchemy.create_engine("mysql://root:root@localhost:3306")

%load_ext sql
%sql mysql://root:root@localhost:3306

### Ejercicios üèãÔ∏è‚Äç‚ôÇÔ∏è

Cinesoft es una empresa cubana de Inform√°tica y Medios Audiovisuales que ofrece soluciones innovadoras orientadas a elevar la calidad del sistema educativo y la gesti√≥n del conocimiento. Para llevar el control de los proyectos que desarrolla, los empleados que all√≠ laboran, etc, la compa√±√≠a cuenta con una base de datos de la cual se extrae el fragmento que se muestra a continuaci√≥n.

**Empleado** (<u>IdE</u> int PRIMARY KEY, Nombre varchar(20), Apellido varchar(20), IdD int, Salario double, Experiencia varchar(20), Edad int)

IdD FK Departamento.IdD

**Departamento**(<u>IdD</u> int PRIMARY KEY, NombreDpto varchar(20), ManagerId int)

ManagerId FK Empleado.IdD

**Proyecto**(<u>IdP</u> int PRIMARY KEY, NombreProyecto varchar(30), Descripci√≥n varchar(50), Presupuesto double, Fecha de inicio DATE, Estado varchar(20), IdD int )

IdD FK Departamento.IdD

**Candidato**(<u>IdC</u> int PRIMARY KEY, Nombre varchar(20), Apellido varchar(20), Salario double, Experiencia varchar(20), Edad int, Puntos int)

In [ ]:
%%sql 
CREATE DATABASE IF NOT EXISTS Cinesoft;
USE Cinesoft;

In [ ]:
%%sql

CREATE TABLE Empleado( 
    IdE INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    Nombre varchar(20),
    Apellido varchar(20),
    Salario double unsigned,
    Experiencia varchar(20),
    IdD int REFERENCES Departamento(IdD)
        ON DELETE SET NULL
        ON UPDATE CASCADE,
    Edad int
);

In [ ]:
%%sql
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Diana', 'Lopez', 11000,'Senior', 1, 30);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Mary', 'Ibarra', 12000,'Senior', 6, 35);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Arlen', 'Echarte', 10000,'Senior', 2, 32);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Jos', 'Alberti', 8000,'Inmediate', 8, 37);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Alina', 'Diaz', 11000,'Senior', 7, 45);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Marcos', 'Martin', 7000,'Inmediate', 3, 44);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Andy', 'Paul', 4000,'Junior', 4, 27);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Victor', 'Lau', 3000,'Junior', 5, 29);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Ruben', 'Peral', 11000,'Senior', 6, 50);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Marcos', 'Perez', 7000,'Inmediate', 3, 44);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Andy', 'Ron', 9000,'Senior', 4, 60);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Victor', 'Klas', 6000,'Intermediate', 5, 27);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Marcos', 'Martinez', 7000,'Inmediate', 3, 44);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Paulina', 'Rubio', 4000,'Junior', 4, 27);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('David', 'Bisbal', 3000,'Junior', 5, 29);

In [ ]:
%%sql

CREATE TABLE Candidato( 
    IdC INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    Nombre varchar(20),
    Apellido varchar(20),
    Experiencia varchar(20),
    Edad int,
    Puntos int
);

In [ ]:
%%sql

INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Gabriel', 'Jolas', 'Senior', 28, 99);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Yosy', 'Contrera', 'Senior', 20, 40);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Susana', 'Giraldo', 'Junior', 38, 30);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Ana', 'Valerio', 'Junior', 24, 29);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Hector', 'Alfred', 'Intermediate', 29, 70);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Alexander', 'Joas', 'Junior', 30, 85);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Alfredo', 'Tomas', 'Senior', 40, 95);

In [ ]:
%%sql

CREATE TABLE Departamento( 
    IdD INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    NombreDpto varchar(30),
    ManagerId int REFERENCES Empleado(IdE)
        ON DELETE SET NULL
        ON UPDATE CASCADE
);

In [ ]:
%%sql
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (1, 'Sistemas', 1);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (2, 'Ventas', 5);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (3, 'Recursos Humanos', 8);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (4, 'IA', 1);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (5, 'Marketing', 2);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (6, 'Log√≠stica y Operaciones', 6);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (7, 'Direcci√≥n General', 3);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (8, 'Control de Gesti√≥n', 9);

In [ ]:
%%sql

CREATE TABLE Proyecto( 
    IdP INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    NombreProyecto varchar(30),
    Descripci√≥n varchar(50),
    Presupuesto double unsigned,
    FechaInicio Date,
    Estado varchar(20),
    IdD int REFERENCES Departamento(IdD)
        ON DELETE SET NULL
        ON UPDATE CASCADE
);

In [ ]:
%%sql
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (1, "Sistemas Preguntas Respuestas", "Lorem Ipsum", 160000, '2021-04-01', "Completado", 4);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (2, "√Årbol rojo feroz", "Lorem Ipsum", 350000, '2021-03-01', "Completado", 1);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (3, "IA para todos", "Lorem Ipsum", 170000, '2022-05-01', "En curso", 1);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (4, "Odisea azul", "Lorem Ipsum", 140000, '2023-04-01', "Completado", 1);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (5, "A", "Lorem Ipsum", 500000, '2020-02-01', "Completado", 2);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (6, "B", "Lorem Ipsum", 400000, '2019-06-01', "Completado", 2);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (7, "C", "Lorem Ipsum", 160000, '2022-07-01', "En curso", 2);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (8, "Capacitaci√≥n inicial", "Lorem Ipsum", 200000, '2023-02-01', "En curso", 5);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (9, "Terciopelo", "Lorem Ipsum", 360000, '2023-04-01', "Pausado", 5);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (10, "Llama dorada", "Lorem Ipsum", 250000, '2019-03-01', "Completado", 8);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (11, "Cosecha de √°mbar", "Lorem Ipsum", 150000, '2018-02-01', "Fallido", 6);

Una vez ejecutadas las celdas para la creaci√≥n de esta BD considere dar respuesta a los requerimientos que se muestran a continuaci√≥n.

a) Proporcione una lista de todos los empleados pertenecientes a departamentos administrados por Diana Lopez.

In [ ]:
%%sql

select distinct emp.Nombre 
from Departamento as d
inner join Empleado as manager 
on manager.IdE = d.ManagerId 
inner join Empleado as emp 
on emp.IdD = d.IdD 
where manager.Nombre = 'Diana' and manager.Apellido = 'Lopez'

b) Recupere el n√∫mero de trabajadores asociados a un mismo departamento que posean igual salario.

In [ ]:
%%sql

select d.NombreDpto, e.Salario, count(e.IdE) as 'CantidadDeEmpleados'
from empleado as e
inner join departamento as d 
on d.IdD = e.IdD
group by d.IdD, e.Salario
order by count(e.IdE) desc

c) Obtener los salarios totales en los departamentos de Ventas y Recursos Humanos combinados y en los departamentos de IA y Sistemas combinados.

d) Cuente cu√°ntos empleados hay en cada rango de salario: bajo, medio y alto. Considere que menos de 3000 es bajo, m√°s de 10000 alto y el resto medio.

e) Cree una vista para obtener el nombre de los empleados asociados a departamentos con al menos 3 proyectos a partir del 2021. Los empleados deben aparecer ordenados seg√∫n su edad, comenzando por el menor.

f) Seleccione los nombres que empiecen con M de todos aquellos empleados asociados a departamentos con al menos 3 proyectos a partir del 2021.

...¬øy con D?

g) Para evitar el contrato de trabajadores de escasa capacidad, la empresa quiere limitar su cantera a personas que alcancen al menos 60 puntos en las pruebas propuestas. Proponga un _trigger_ que verifique no se puedan insertar a la base de datos empleados con una puntuaci√≥n menor a 60.

h) La empresa quiere remunerar el trabajo de los empleados. Cree un _trigger_ que aumente el salario de un empleado en un 10 % cada vez que un proyecto asociado a su departamento incremente su presupuesto.

i) En la tabla Candidatos se registra la puntuaci√≥n que han obtenido ciertas personas en entrevistas que han realizado para aplicar a la empresa con anterioridad. Cree un procedimiento almacenado que reciba un valor $x$ y mueva hacia la lista de trabajadores de la empresa a los empleados de la cantera que hayan culminado las pruebas con un valor superior a esa marca. Aseg√∫rese de recibir el nombre del departamento al cual asociar el(los) trabajador(es), y un salario inicial.

> **Voz en _off_ con tono grave:** lo que van a leer a continuaci√≥n es s√≥lo un producto de nuestra imaginaci√≥n, cualquier semejanza con la realidad es pura coincidencia.

j) En Cinesoft hay un comedor y se hace cola para almorzar. Un ejecutivo que se encontraba de visita en la empresa se pregunta cu√°ntas posibles colas se pueden formar, si se asume que todos los empleados que se encuentran registrados van a almorzar. Por favor, ay√∫delo con su pregunta existencial.

k) Cree un procedimiento almacenado que devuelva una tabla de 3 columnas: Empleado, Departamento y Pertenencia. La tabla debe representar todas las posibles combinaciones de empleados y departamentos, y debe colocar en la celda correspondiente a la columna Pertenencia si el empleado pertenece o no al departamento.

> **Voz en _off_ con tono grave:** vamos a hacer esto m√°s interesante üòà

Las restricciones de acceso a la BD cambiaron. Ahora, ning√∫n usuario externo puede realizar consultas o modificaciones directamente, s√≥lo puede llamar a procedimientos almacenados que realicen las consultas o modificaciones en su lugar. Aun as√≠, no todos los usuarios pueden ordenar la ejecuci√≥n de ciertas operaciones.  

Contamos con una nueva tabla llamada Privilegios que almacena los privilegios que posee cada usuario:

In [ ]:
%%sql
CREATE TABLE Privilegios (
  Id INT AUTO_INCREMENT PRIMARY KEY,
  UserId VARCHAR(255),
  Privilegio VARCHAR(255)
);

In [ ]:
%%sql
INSERT INTO Privilegios (UserId, Privilegio) VALUES ("root@localhost", "view_salary");
INSERT INTO Privilegios (UserId, Privilegio) VALUES ("root@localhost", "update_salary");
INSERT INTO Privilegios (UserId, Privilegio) VALUES ("yosvaniiiii@repahost", "view_salary");

l) Cree un procedimiento almacenado que permita cambiar el salario de un empleado. El procedimiento debe lanzar una excepci√≥n si el usuario que lo llama no posee los requisitos necesarios.